/*
 * 英文
 */
"hello" = "hello";

"app.notOppen"                    = "Comming soon";
"app.reminder"                    = "Reminder";
"app.sure"                        = "Confirm";
"app.cancel"                      = "Cancel";
"app.changeLanguageMessage"       = "Sure to switch into %@?";
"app.openCameraPermissions"       = "Open the permission to video camera in Setting!";
"app.openAlblumPermissions"       = "Open the permission to photo album in Setting!";

"app.touchID_touchIDMessage"      = "Enter the fingerprint";
"app.touchID_usePhone"            = "Log in with phone number";
"app.touchID_useTouchID"          = "Log in with Touch ID";

"app.refresh.title"               = "There's a new version";
"app.refresh.sure"                = "To update";

"app.noData"                      = "No Data";

"app.name"                        = "M-berry";

//-----------------------Login---------------------
"login.loginTitle"                = "Login";
"login.inputPhone"                = "Enter phone number";
"login.inputPwd"                  = "Enter password";
"login.forgetPwd"                 = "Forget password?";
"login.registerTitle"             = "Register";

"register.codeTitle"              = "CAPTCHA";
"register.codeBtnTitle"           = "CAPTCHA";
"register.codeBtnCountDownTitle"  = "%lds";
"register.inputPwd"               = "Enter  password(6-20)";
"register.re_inputPwd"            = "Reenter password";
"register.inputNickName"          = "Enter nickname(4-16)";
"register.agreTermBefore"         = "Click register to agree";
"register.agreTermAfter"          = " User Agreement";
"register.codeSendSuccess"        = "CAPTCHA sent successfully";
"register.success"                = "Register successfully, please login";


"finPwd.title"                    = "Retrieve Password";
"finPwd.next"                     = "Next";
"findPwd.using"                   = "You are recovering password via this phone";
"findPwd.codeTitle"               = "CAPTCHA";
"findPwd.done"                    = "Done";
"findPwd.success"                 = "Reset password successfully!";



//-----------------------TabBar---------------------
"tabBar.main"                      = "Home";
"tabBar.community"                 = "Community";
"tabBar.wallet"                    = "Wallet";
"tabBar.me"                        = "Mine";


//------------------------Main-----------------------
"main.naviTitle"                   = "BlockCDN";
"main.incomeTitle"                 = "Income";
"main.serviceTitle"                = "Service";
"main.incomYesterday"              = "Yesterday’s Income";
"main.incomBCDN"                   = "  BCDN";
"main.incomCurrent"                = "Spot Price≈  ";
"main.incomUSDNBCDN"               = "  USD/BCDN";
"main.incomeTotalIncome"           = "Total Income(BCDN)";
"main.incomeTotalValue"            = "Total Value(USD)";
"main.machineOnline"               = "Mine machine online";


"main.serviceBtnTitle1"            = "Reservation code";
"main.serviceBtnTitle2"            = "Asset Import";
"main.serviceBtnTitle3"            = "Bind Invite Code";



"main.apponitCodeNaviTitle"        = "Reservation code";
"main.apponitCodeDayTitle"         = "Day";
"main.apponitCodeHourTitle"        = "Hour";
"main.apponitCodeMinuteTitle"      = "Minute";
"main.apponitCodeSecondTitle"      = "Second";
"main.apponitCodeFormatTime"       = "%@ extract code";


"main.appointCodeNotBindETHTitle"  = "Binding ETH wallet address to participate in lottery";
"main.appointCodePersonTitle"      = "Total reservations currently:%@";
"main.appointCodeBindETHTitle"     = "Bind";
"main.appointCodeBindETHNotice"    = "[NOTICE]\n\n1.The binding ETH address is your verification address where you must guarantee at least 1000 BCDN tokens.\n2.Binding sucessfully means that you can attend the activity\n3.The verification address is also the withdrawal address of mining income. And you can only withdraw to the binding ETH address which isn’t modified.";

"main.appointCodeCodeTitle"        = "Your reservation code";
"main.appointCodePasterSuccess"    = "Copy successfully";
"main.appointCodeSuccessNotice"    = "[NOTICE]\n\n1.After the verification, you will get a reservation code.\n2.Then you just need to wait until drawing a lottery.\n3.The system selectes randomly a certain number of reservation codes during the lottery drawing.\n4.If your reservation code is selected, it is the invite code. In the contrary, if not, it is useless.\n5.You can attend the drawing next time if not been selected, and will get different reservation code in the next drawing.";

"main.appointCodeJoinTitle"        = "You haven’t participated in activities,join now";
"main.appointCodeJoinETHTitle"     = "ETH address:%@";
"main.appointCodeJoin"             = "Order immediately";

"main.appointCodeJointPeopleTitle" = "Reservation Number";
"main.appointCodeJointPeopleCount" = "%@ person";

"main.appointCodeSuccessTitle"     = "Congratulation";
"main.appointCodeSuccessCodeTitle" = "Your reservation code";
"main.appointCodeSuccessPastTitle" = "Long press to copy";

"main.appointCodeFaildTitle"       = "Sorry,reservation code failure,please try again";
"main.appointCodeFaildCodeTitle"   = "Your reservation code";
"main.appointCodeFaildAgainTitle"  = "Order again";

"main.appointCodeLotteryListTitle" = "Winning List";
"main.appointCodeCongratulationTitle"  = "Congratulate %@";

"main.appointmentGetCodeSuccess"   = "Order successfully";



"main.bindMiningCode.miningCodeTitle"        = "Mining Code";
"main.bindMiningCode.miningCodePlaceHolder"  = "Enter mining code";
"main.bindMiningCode.sure"                   = "Sure";
"main.bindMiningCode.message"                = "[NOTICE]\n\n1.Must bind mining code to start mining.\n2.Two kinds of mining code are available: W-started mining code which obtained by  M-berry APP. S-started mining code abstained by BlockCDN community activities.\n3.W-started mining code can only bind with APP account which participated in reservation activity, S-started mining code can bind with any APP account.\n4.Mining code is binding to withdrawal address, whether binding to W-started or S-started mining code, unbinding is not available. Be cautious. ";
"main.bindMiningCode.success"                = "Bind Success!";


"main.importProperty.naviTitle"              = "Asset Import";
"main.importProperty.title1"                 = "Website Assets";
"main.importProperty.title2"                 = "Beta mining income";
"main.importProperty.officalWeb.emailTitle"                 = "Email Address";
"main.importProperty.officalWeb.correctEmail"               = "Enter the correct E-mail address";
"main.importProperty.officalWeb.emailPlaceHolder"           = "Enter website email address";
"main.importProperty.officalWeb.verifyCodeTitle"            = "CAPTCHA";
"main.importProperty.officalWeb.verifyCodePlaceHolder"      = "CAPTCHA";
"main.importProperty.officalWeb.pwdTitle"                   = "Official website login password";
"main.importProperty.officalWeb.pwdPlaceHolder"             = "Official website login password";
"main.importProperty.officalWeb.sureTitle"                  = "Sure";
"main.importProperty.officalWeb.success"                    = "Asset import success";
"main.importProperty.officalWeb.message"                    = "[NOTICE]\n\n1.Import asset is for users who hold BTC,ETH and legal BCDN tokens on the BlockCDN official website.\n%@\n3.After importing asset, your BCDN tokens will transfer to APP balance.\n4.If importing successfully, all your assets on the official website will be cleared, please exercise caution.";
"main.importProperty.officalWeb.message1"                   = "2.Special notice:Due to the refund work has ended, all the refund withdrawal function has been closed. If you have BTC and ETH balance in the official website, then importing assets successfully, your balance will be automatically converted to BCDN tokens according to 1BTC equal 61000BCDN, 1ETH equal 5000BCDN.";
"main.importProperty.testIncome.ethTitle"                   = "ETH Address";
"main.importProperty.testIncome.ethPlaceHolder"             = "Enter ETH Address";
"main.importProperty.testIncome.codeTitle"                  = "Closed beta code";
"main.importProperty.testIncome.codePlaceHolder"            = "Enter beta code";
"main.importProperty.testIncome.sureTitle"                  = "Sure";
"main.importProperty.testIncome.success"                    = "Asset import success";
"main.importProperty.testIncome.message"                    = "[NOTICE]\n\n1.Importing closed beta mining income just for the early miners.\n2.The former mining procedure scrapped, and the withdrawal function abolished. All the mining assets during the beta testing can be withdrawn on M-berry APP.\n3.Please enter ETH address which binding to testing mining procedure. Please enter closed beta code which binding to testing mining procedure.\n4.ETH address and the beta code is binding pairing, forgetting any one can not import early closed beta mining revenue.\n5.Successful import beta mining revenue, the original mining procedure data will be cleared.";
"main.importProperty.alertTitle1"                           = "Balance of official website wallet";
"main.importProperty.alertTitle2"                           = "Balance of beta mining revenue";
"main.importProperty.alertBCDNCount"                        = "%@ BCDN";
"main.importProperty.alertOnceImport"                       = "Import";



//-----------------------Bind ETH---------------------------
"bindETH.naviTitle"                = "Bind ETH";
"bindETH.title"                    = "Enter account which hold 1000 BCDN";
"bindETH.inputHolder"              = "Enter ETH address";
"bindETH.bindTitle"                = "Bind ETH address";
"bindETH.message1"                 = "PS: In order to prevent  brush code maliciously, you must ensure that your account holds more than 1000 BCDN during the booking and lottery. Otherwise it will affect your eligibility!%@";
"bindETH.message2"                 = "All the mining revenue of this mining code can only be withdrawn to the verification wallet, and can not be changed after verification.";
"bindETH.success"                  = "Bind ETH address successfully";





"bindETH.new.naviTitle"            = "Select verification address";
"bindETH.new.defaultTitle"         = "ETH address";
"bindETH.new.defaultPlaceHolder"   = "Enter ETH address";
"bindETH.new.gateIOTitle"          = "gate.io address";
"bindETH.new.gateIOPlaceHolder"    = "Enter gate.io address";
"bindETH.new.bindBtnTitle"         = "Binding";
"bindETH.new.bindMessage"          = "1.The verification method: personal ETH wallet address and the paid address of BCDN tokens in the Gate.io Exchange.personal wallet address not the Exchange address: mist, parity, myetherwallet and imtoken; the verification of the paid address in the Gate.io Exchange is BCDN paid address.\n2.You must guarantee that the number of BCDN is more than 1000 to pass verification. Then you can attend the drawing a lottery.\n3.Verification needn’t transfer, and you have a full right of free and control so we can’t freeze it.\n4.After verification, if you want to mine, you must hold 1000 BCDN tokens in your verification address until getting the invite code. If Your tokens is less than 1000, you can’t attend the activity.\n5.The verification address is also the withdrawal address of mining income. And you can only withdraw to the binding ETH address which isn’t modified.";
"bindETH.new.bindGateIOSucess"     = "Binding gate.io success";



//-----------------------Community----------------------
"community.naviTitle"              = "Community";



//-----------------------Wallet----------------------
"wallet.naviTitle"                 = "Wallet";
"wallet.BCDN"                      = "BCDN";
"wallet.remain"                    = "Balance";
"wallet.will"                      = "Under Review";

"wallet.gridBillTitle"             = "Bill";
"wallet.gridDepositTitle"          = "Withdraw";
"wallet.gridChargeTitle"           = "Recharge";
"wallet.gridTransferTitle"         = "Transfer";
"wallet.gridMiningIncomeTitle"     = "Mining Income";



"wallet.depositNaviTitle"          = "Withdraw";
"wallet.depositHistoryTitle"       = "History";
"wallet.depositTitle1"             = "BCDN withdraw address:\n%@";
"wallet.depositTitle2"             = "Withdrawal Amount:";
"wallet.depositTitle3"             = "Withdrawal Amount";
"wallet.depositTitle4"             = "Available Balance";
"wallet.depositTitle5"             = "Commission";
"wallet.depositTitle6"             = "Withdraw All";
"wallet.depositTitle7"             = "BCDN";
"wallet.depositTitle8"             = "Next";
"wallet.depositTitle9"             = "Withdraw: withdraw your  balance to binding ETH address";
"wallet.depositTitle10"            = "You haven’t bind ETH address";


"wallet.depositVerifyTitle"        = "CAPTCHA";
"wallet.depositVerifyDone"         = "Done";
"wallet.depositSuccess"            = "Withdraw Successfully";

"wallet.reminder"                  = "Reminder";
"wallet.reminderMessage"           = "Can’t withdraw since no binding ETH address";
"wallet.reminderCancel"            = "Cancel";
"wallet.reminderGo"                = "Bind";

"wallet.depositHistoryReady"       = "Under Review";
"wallet.depositHistoryFaild"       = "Failed to withdraw";
"wallet.depositHistorySuccess"     = "Withdraw Successfully!";
"wallet.depositHistoryBCDN"        = "BCDN";



"wallet.miningIncomeNaviTitle"     = "Mining Income";
"wallet.miningIncomeBCDN"          = "BCDN";
"wallet.miningIncomeSumIncome"     = "Mining Income";
"wallet.miningIncomeTodayIncome"   = "Yesterday’s Income";
"wallet.miningHistoryTitle"        = "History";
"wallet.miningTableTitle"          = "Mining procedure number";



"wallet.transfer.typeCommon"       = "General transfer";
"wallet.transfer.typeWechat"       = "withdrawl of Wechat red packet";
"wallet.transfer.typeAssetImport"  = "Asset import";
"wallet.transfer.typeUnknown"      = "Unknown transfer";
"wallet.transfer.stateWait"        = "Under review";
"wallet.transfer.stateSuccess"     = "Transfer successful";
"wallet.transfer.stateFail"        = "Transfer failed";




//------------------------Me--------------------------
"me.naviTitle"                      = "Personal Center";

"me.headTitle"                      = "Head Portrait";
"me.nickNameTitle"                  = "Nickname";
"me.ETHTitle"                       = "ETH Address";
"me.phoneTitle"                     = "PhoneNumber";
"me.myMiningCode"                   = "My code";
"me.languageTitle"                  = "Language";
"me.modifyPwdTitle"                 = "Change Password";
"me.versionTitle"                   = "Update";
"me.aboutTitle"                     = "About BlockCDN";
"me.exit"                           = "Log Out";

"me.copy"                           = "Copy";
"me.mineMachineOnline"              = "Online";
"me.mineMachineOff"                 = "Offline";
"me.noMiningCode"                   = "No mining code";

"me.bindETH"                        = "No ETH address";

"me.cameraTitle"                    = "Take Photo";
"me.alblumTitle"                    = "Choose From Album";
"me.cancelTitle"                    = "Cancel";

"me.logoutTitle"                    = "Reminder";
"me.logoutMessage"                  = "Sure to log out?";
"me.logoutSure"                     = "Sure";
"me.logoutCancel"                   = "Cancel";

"me.modifyNameTitle"                = "Change Name";
"me.modifyNamePlaceholder"          = "Enter name(4-16 digits)";
"me.notEmoji"                       = "No emoticons in name";
"me.modifyNameSubmitTitle"          = "Submit";
"me.modifyNameSuccess"              = "Modify Success!";


"me.modifyPhoneTitle"               = "Change Phone Number";


"me.modifyPwdTitle"                 = "Change Password";
"me.modifyInputOriginPwdTitle"      = "Former password";
"me.modifyInputNewPwdTitle"         = "New password(4-16 digits)";
"me.modifyReInputNewPwdTitle"       = "Re-enter new password";
"me.modifyInputCodeTitle"           = "CAPTCHA";
"me.modifySureTitle"                = "Sure";
"me.modifyPwdSuccess"               = "Change password successfully,please log in";




//------------------------Net Return Code-----------------
"return_302"                       = "Login failed,wrong password or wrong account";
"return_303"                       = "Your login has expired,please login again!";
"return_315"                       = "Wrong phone number";
"return_413"                       = "Wrong CAPTCHA or the phone number has been registered";
"return_414"                       = "Wrong CAPTCHA";
"return_304"                       = "Head portrait upload failed";
"return_305"                       = "Change phone number failed";
"return_422"                       = "Phone number has been registered";
"return_2000"                      = "You can’t participate in activity since your BCDN balance is %@";
"return_2002"                      = "Wrong ETH address or the ETH address has been binding!";
"return_2101"                      = "Mining code not exist";
"return_2102"                      = "Mining code has been bound";






//验证码发送成功
"return_300000"                    = "CAPTCHA sent successfully";
//验证码发送失败
"return_300001"                    = "CAPTCHA sent failed";
//验证码错误
"return_500002"                    = "Wrong CAPTCHA";
//验证码过期
"return_500003"                    = "Invalid CAPTCHA";
//获取官网资产成功
"return_500110"                    = "Get asset success";
//输入信息有误
"return_500111"                    = "Your input is incorrect,please re-enter";
//BCD余额不足
"return_500112"                    = "BCDN balance insufficient,cannot be imported";
//导入资产成功
"return_500120"                    = "Asset import success";
//导入资产失败
"return_500121"                    = "Asset import failed";
//获取内测挖矿收益资产成功
"return_500130"                    = "Get asset success";
//输入信息有误
"return_500131"                    = "Your input is incorrect,please re-enter";
//BCDN余额不足
"return_500132"                    = "BCDN balance insufficient,cannot be imported";
//导入资产成功
"return_500140"                    = "Asset import success";
//导入资产失败
"return_500141"                    = "Asset import failed";
//获取数据成功
"return_500200"                    = "Get the data successfully";
//获取转账数据成功
"return_700300"                    = "Get the data successfully";


































